# Built In Failures Family Failures Cannot Change Type Line Based Property

Source: https://www.revitapidocs.com/2026/eed4c48b-7118-8a10-5b6c-da9805b4ccf8.htm

---

| Built In Failures Family Failures Cannot Change Type Line Based Property |
| --- |

Can't change type of "\[Family Name]" from line based to non\-line based or vice\-versa.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CannotChangeTypeLineBased { get; }
```

```
Public Shared ReadOnly Property CannotChangeTypeLineBased As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CannotChangeTypeLineBased {
	FailureDefinitionId^ get ();
}
```

```
static member CannotChangeTypeLineBased : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures FamilyFailures Class Autodesk.Revit.DB Namespace